tutorials-OpenFOAM-8/reverseBurner-chtMultiRegionFoamLTS/constant/gas/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    energySource
    {
        type            semiImplicitSource;

        timeStart       0;
        duration        1000;
        selectionMode   cellSet;
        cellSet         ignition;
        volumeMode      specific;

        sources
        {
            h
            {
                explicit    5e7; // kg/m/s^3
                implicit    0;
            }
        }
    }
}


// ************************************************************************* //
